Revit 2026 API

# BuiltInFailuresNumberingFailures Class

---

Failures related to object numbering operations.

SystemObject Autodesk.Revit.DBBuiltInFailuresNumberingFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class NumberingFailures
```
```vb
Public NotInheritable Class NumberingFailures
```
```cpp
public ref class NumberingFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type NumberingFailures = class end
```

The BuiltInFailuresNumberingFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InputOutOfValidRangeError | The input value is out of the allowed range. |
|  | MoreThenOneElementWasChanged | The operation lead to the renumbering of more then one element. |
|  | NumberAlreadyInUseError | The new number is already in use. |
|  | SampleNumberingError | Replace this with the first real one |

#### Reference

Autodesk.Revit.DB Namespace